#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag               = "77b7d61b5d3fa5da1efbddf88c89d6a7" -> "867bea2ed94b41658abc568bf42ecaf5"
        id                 = "lambdas/demo/add_investment_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag               = "fe67e98fd56df7809f42e62c857e9c45" -> "6007683ec4344e77cab66ee61f9d0315"
        id                 = "lambdas/demo/add_scenario_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "d92badc46a72a70bccbd2a63615da7a9" -> "7969e17a6cdb3e083ba842e6098d14cd"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "496bb5ff0d6d0190aa7d08b8b286e595" -> "5cf794aabecac409b108244e403a6d30"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "8d5d7db537957f6e608027f9a750856c" -> "47affaaaccbbb2cd955ca69a178ef64f"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "909f631609415403e4546365b19ed7b9" -> "424bd5918fbb09a1fcb930b2fe16ae74"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "1175eb3c563494fd26c478d2cb9a8c80" -> "cb2bb37fa9479729f406126564029470"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "8d69000297b9b6566af01390d6430f1c" -> "3d8089df7ae91ff77009e63b3b0fdb88"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag               = "6e21e1588b6ea6846950e1d06ace9a2d" -> "f32dff9e9abd3a8dd5366d3e0c3c30b7"
        id                 = "lambdas/demo/delete_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag               = "1ca1192b5c43d21f878e9c04473be7aa" -> "c019bf0cc2fca910537610c16abd6349"
        id                 = "lambdas/demo/delete_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "e1a59f70691d963ffe2d4e553471316d" -> "89af436d00df4f7459ec42f1d3e7bd39"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "291f547c128dd74bad658c9553d60740" -> "fa5ee545ecc51626bc6c7aaf10341730"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag               = "a452bbc1d22ea2f143e76c61e9603d85" -> "64816e96ee20bcbd1cdfabd333ec70d2"
        id                 = "lambdas/demo/edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "c58b1e062af99d900ac68c602bc74d4d" -> "c9b7e0caed36eb76f2299265fe75ec23"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "730953baf5285df9cf1cb27a37098fa9" -> "6f1096b69882ad139f6913e79fb437c7"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be created
  + resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      + acl                    = "private"
      + bucket                 = "kpinetwork-backend"
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "1aba8d4eaa5d85efb8b5e49ed618dd5c"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "lambdas/demo/get_all_tags_handler.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "buckets/../../dist/get_all_tags_handler.zip"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag               = "389e35e291dd3fd38a98d2e85283d130" -> "8610cbb261209c8c1d17a04fdd5b176a"
        id                 = "lambdas/demo/get_by_metric_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag               = "d92622e7d86adad6d7815561c8e4f290" -> "723d0b7062e65b03e4bb3a832ddbb75c"
        id                 = "lambdas/demo/get_company_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag               = "ab04c467451bcd8247ba3a48b4c5f7e3" -> "b03da825de3803a4d891d1990f3eda9b"
        id                 = "lambdas/demo/get_company_investments_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "f660766bd9f45abaff01c8afbd1930fc" -> "b9008a742f441b5b24ace319eab1ecaa"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "a9f0447e0d48c1543a34c3ca899f00f4" -> "ae5b53e85819e462f32ea50bb188ad72"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "16332e3a2ff7cfa8423010719e450c52" -> "ccaa085e7c6454e042530f6600153ea8"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag               = "911b4cfe4a492023936c141dd1830313" -> "6002b80a9054567bf4ea880513a39ce1"
        id                 = "lambdas/demo/get_dynamic_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag               = "c9e84d3f23710949be0467813947696c" -> "9f0507b2ea90b6b09f4012a572b11b01"
        id                 = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag               = "8acb2b657ce337c32d73f6634c0d8012" -> "0e7ca328c7d13778409b048536eb7090"
        id                 = "lambdas/demo/get_investment_date_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_year_options_function_object will be destroyed
  # (because aws_s3_bucket_object.get_investment_year_options_function_object is not in configuration)
  - resource "aws_s3_bucket_object" "get_investment_year_options_function_object" {
      - acl                = "private" -> null
      - bucket             = "kpinetwork-backend" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "binary/octet-stream" -> null
      - etag               = "1fe0e1235f31312c0423e6e151b73100" -> null
      - force_destroy      = false -> null
      - id                 = "lambdas/demo/get_investment_year_options_handler.zip" -> null
      - key                = "lambdas/demo/get_investment_year_options_handler.zip" -> null
      - metadata           = {} -> null
      - source             = "buckets/../../dist/get_investment_year_options_handler.zip" -> null
      - storage_class      = "STANDARD" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
    }

  # module.buckets.aws_s3_bucket_object.get_investment_year_report_function_object will be destroyed
  # (because aws_s3_bucket_object.get_investment_year_report_function_object is not in configuration)
  - resource "aws_s3_bucket_object" "get_investment_year_report_function_object" {
      - acl                = "private" -> null
      - bucket             = "kpinetwork-backend" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "binary/octet-stream" -> null
      - etag               = "8a37f6051f84497159f1c246f3318e6d" -> null
      - force_destroy      = false -> null
      - id                 = "lambdas/demo/get_investment_year_report_handler.zip" -> null
      - key                = "lambdas/demo/get_investment_year_report_handler.zip" -> null
      - metadata           = {} -> null
      - source             = "buckets/../../dist/get_investment_year_report_handler.zip" -> null
      - storage_class      = "STANDARD" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag               = "d1db49c52d54c4377e3097568f685b90" -> "89b01a20f54836d6579d82a779c275b2"
        id                 = "lambdas/demo/get_metric_types_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "51c1b6868ecc10440eb8fab58ee08f73" -> "188a0c6e1b9731278f2cbcce9893eebc"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "a15daac980db0aa106b563e3b929b4a9" -> "b74315d6871e3a6e0c146944c868523c"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "182ab50e24f1017e8c2478d0c6744693" -> "20364f3bc1d4554f98aa2abf4b285b89"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "548acc51ca918d50471e04ad1626320e" -> "9862e7a1720e9d294a59484b51d2f393"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "944c8f2d1ab021fab7d51592fb5c420b" -> "fc3a01af1d3aec19a59e5b9c24306433"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "0b5a9d5e8729b62f9a766a4b7fd44f52" -> "3565dffa88bc12775a806abe477a870b"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "fec04bf89294039af7f12cf7d123872e" -> "809101affbd71008fd721d1617c589c7"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "1fe52fd64010c8b1d135a249d02c0f05" -> "8aa502e05c9138673374fe8ba1f6b7e0"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag               = "42cdaed161941902bd4735c434dec5e3" -> "b7ebc694d21b45d1961e4b8dfe71420a"
        id                 = "lambdas/demo/update_data.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "53decc18ba4c79b5bc6f83b2a4edfed4" -> "6d2db1da4b563cb6190ab0bbe11a10b5"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "6b0b9216b20c24db0dd7f396320a7bc3" -> "6e469a30deb0de89364d2cc51e32eaea"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "91d93bb574f912864d3f9fc920e2fd38" -> "461fd2595df622640044e4e7e97b5739"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2022-09-30T18:08:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "fshoLqWU6fXKFSqWOB9x6qZk20pMfOubg6NLKly5lTI=" -> "kGLk99VCKCq5IH+ujqI2AROwMFS8tJ4mgwUXwjggNlI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2022-09-30T18:09:17.000+0000" -> (known after apply)
      ~ source_code_hash               = "7Sqlb907IxeKsx+Nl/wmdAtxw46S8AcNifvelIH+htw=" -> "cvXfKSelXT6CoashLQoy1+Dzguqfw3juizdaaTFboXQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2022-09-30T18:08:37.000+0000" -> (known after apply)
      ~ source_code_hash               = "CyHUVfcBtKr3RWZ8BOjIM877h8LyTUB8o5x+n7VjaTI=" -> "6lGA77ZH860HWJi6zK29EWhoNRqT0cec4rcmLOYCzks="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2022-09-30T18:09:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "d3iFPY4h4WLSKz1hdOoGt0hZCZIjrvw8h1CWA7WWn9Y=" -> "OdlBmr5MrHSIDChRRcU3+TzkJ4ryilHGRBgRX09OEL4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2022-09-30T18:09:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "6TsivgwUC7Er2GPSzyAZ318rDwc5n7529opsxEDynRY=" -> "zDxsfupGRjOC1GfIfWKPFHolY5FCflbVNIx/6/dlzXk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2022-09-30T18:08:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "RL7QBzCLJ4bW/NuK9P4AiigfgoqAD3wXXLHiDqUxra8=" -> "aoumQtHxT2g8llu7fm62kGbsjrtmakDvPQeraFehvkM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2022-09-30T18:09:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "qBzSm5vmhbe88zOo3n8kY/fGkpMkIgqiNcw3a5vU9j8=" -> "tyXIfw4bAdWMwkybkJWW/ODuIghqWOJXLBNK7mTrQGM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2022-09-30T18:08:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "Ejl7GDJw9DF/0vlex+gfrRb/Vyp0yfVlEw2XrLaJmXA=" -> "MmW4nKjjDBKKCilpa+hYLzuMD0we7VgEiAMq/VsoISE="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2022-09-30T18:09:17.000+0000" -> (known after apply)
      ~ source_code_hash               = "hwKj55LvbBKyfGjE7UVRMEgWjRzbJ0rBWeW8uM2M4Hk=" -> "mV4rcSir5WirZCpMFr9SS27o+iplwMez6eludMEOcFQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2022-09-30T18:09:17.000+0000" -> (known after apply)
      ~ source_code_hash               = "fmYq/0B8jfdegpydqAH90lDtxFt+Aw+7jweL48ClHdI=" -> "oCLQ50uUVnIyzJSAAhpLzv9JOqIUBzYL8A/mRGzjOnQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2022-09-30T18:08:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "RioVkOA9XP5et56zms7g8A23iuTDDiK39Uie6Sjuj9Q=" -> "xgVu1DRkJEu6yedNG9rJvRm8stF/N+ROtYc/NMWWp88="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-09-30T18:09:17.000+0000" -> (known after apply)
      ~ source_code_hash               = "Bnv7iUbr1K2H6DXOeB5lqO4LWys9irNSiOVOBC0DOpE=" -> "xustwowqV6iJFQiIuiTrq1fq77fGQEuBMbYDVKDjc4A="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-09-30T18:09:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "HS+0kI9AkoCVw/EjnRQngeoCeQEVZBNbFDjAr3HqO6E=" -> "oay6jx/sfmNrCi0yQ9o5MZKYFkEOgDo+IgQ1uXT/VLY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2022-09-30T18:08:37.000+0000" -> (known after apply)
      ~ source_code_hash               = "0F3ULD3wPXNebcyyiSuZQkFnFm/yvOGOBTwF/if1b9U=" -> "6plXQhZRCT+hirxDWNgySkeOAkrf9qc4zRoGy4ia1rM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2022-10-03T17:20:59.000+0000" -> (known after apply)
      ~ source_code_hash               = "DSkI3sQRneHheFm9KInHOW3BE5r+gJPAMI2V/bLmiD4=" -> "EmbqyGOJxAQ8vand+7AMCPMTKOsFP+T/Gsx/j1wYvqo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be created
  + resource "aws_lambda_function" "get_all_tags_lambda_function" {
      + arn                            = (known after apply)
      + function_name                  = "demo_get_all_tags_lambda_function"
      + handler                        = "get_all_tags_handler.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + s3_bucket                      = "kpinetwork-backend"
      + s3_key                         = "lambdas/demo/get_all_tags_handler.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "tvR/KGvE/YBFsUg9Jz+sTszIpB3Ch33NlP9Su/RGBxU="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 100
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ACCESS_KEY"   = (sensitive)
              + "DB_HOST"      = (sensitive)
              + "DB_NAME"      = "demokpinetworkdb"
              + "DB_PASSWORD"  = (sensitive)
              + "DB_USERNAME"  = (sensitive)
              + "SECRET_KEY"   = (sensitive)
              + "USER_POOL_ID" = "us-west-2_usXw4S12D"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-0bda66e4a9afc62a9",
            ]
          + subnet_ids         = [
              + "subnet-0264422b45299167e",
            ]
          + vpc_id             = (known after apply)
        }
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2022-09-30T18:09:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "+J0R7p9wnt/MFD5diNufPLuxHIQ2zub2chmmoXjgEcg=" -> "H+Wm9Ewi9W0yXUsIp4kGMsFViXff9KJtitV84aF7moA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2022-09-30T18:09:21.000+0000" -> (known after apply)
      ~ source_code_hash               = "0k1CRzS3J9MYzkAnMK2GfzK2JUUhOXTO/C1vQhIYCfA=" -> "HJo1pr+gcMeCt43KrNCO+u+UuypjpaYnLURTZZwwALA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2022-09-30T18:08:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "yBeuHuFHVzw3XCc5Y34EpB8duxXhdu06a7D2W072vXU=" -> "92JD6jAI7iFGpVY0fVQqMt5sQZiQV5Je5ETy8QxFyt4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2022-09-30T18:08:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "sg6EKq0bxKqDJyIT2aob6+urS34CsqnKvZJg+SGF0IY=" -> "CH+XFryRhI/GAbzZaiNlZfRVMKL5GoWPc3tdX0qm4fs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2022-09-30T18:09:17.000+0000" -> (known after apply)
      ~ source_code_hash               = "NWzy/Wq5BR3P5OwcoUJoDqKsEq2lIJZkqtsXhyMvsJk=" -> "EUluXxg4w9ChAiVNIv2KYgY6rw4zHEd6ORunlKPg398="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-09-30T18:08:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "z6kOrmXCir5rdtmCCSCVeDUPeLkQ3fMemN3im+3naSQ=" -> "6ImL0OnBWxiENGyPYcewcKiuwo0tJrCKp+hvz4w5e0Q="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2022-09-30T18:09:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "MBrdeAJvwqgzo//jjIQ+E+gDprwbsEPgpro4+uBcv/4=" -> "UWOnmL8pktlT+Ppo3tbER+U1m8ASqTLLpYs+MhSL+vM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-09-30T18:09:17.000+0000" -> (known after apply)
      ~ source_code_hash               = "PF8WAD8Vm3T+eCfT9YEtLXTeLp+tLGZAkR7BXB1bWn8=" -> "C2e+aR/z2mDGpxEHVPaMUlx5WK+0fvS2StAKI6ai5cw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2022-09-30T18:09:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "Y9/furq3Rf/najoGfE/silCYRFAJ0J/LxrtBC9kR3/k=" -> "hP6yTlYPAaXTVotKXu0MSb8w3To+F/oA0wxcnHabe0A="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_year_options_lambda_function will be destroyed
  # (because aws_lambda_function.get_investment_year_options_lambda_function is not in configuration)
  - resource "aws_lambda_function" "get_investment_year_options_lambda_function" {
      - arn                            = "arn:aws:lambda:us-west-2:435552912911:function:demo_get_investment_year_options_lambda_function" -> null
      - code_signing_config_arn        = "" -> null
      - description                    = "" -> null
      - function_name                  = "demo_get_investment_year_options_lambda_function" -> null
      - handler                        = "get_investment_year_options_handler.handler" -> null
      - id                             = "demo_get_investment_year_options_lambda_function" -> null
      - image_uri                      = "" -> null
      - invoke_arn                     = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:435552912911:function:demo_get_investment_year_options_lambda_function/invocations" -> null
      - kms_key_arn                    = "" -> null
      - last_modified                  = "2022-09-30T18:08:57.000+0000" -> null
      - layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22",
        ] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:us-west-2:435552912911:function:demo_get_investment_year_options_lambda_function:$LATEST" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::435552912911:role/demo_get_investment_year_options_lambda_exec_role" -> null
      - runtime                        = "python3.8" -> null
      - s3_bucket                      = "kpinetwork-backend" -> null
      - s3_key                         = "lambdas/demo/get_investment_year_options_handler.zip" -> null
      - signing_job_arn                = "" -> null
      - signing_profile_version_arn    = "" -> null
      - source_code_hash               = "oTq2/u5VImFafUgdNN2Qrqkht87ArqDgZlY1DykUABs=" -> null
      - source_code_size               = 123504 -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
      - timeout                        = 100 -> null
      - version                        = "$LATEST" -> null

      - environment {
          - variables = {
              - "DB_HOST"     = (sensitive)
              - "DB_NAME"     = "demokpinetworkdb"
              - "DB_PASSWORD" = (sensitive)
              - "DB_USERNAME" = (sensitive)
            } -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }

      - vpc_config {
          - security_group_ids = [
              - "sg-0bda66e4a9afc62a9",
            ] -> null
          - subnet_ids         = [
              - "subnet-0264422b45299167e",
            ] -> null
          - vpc_id             = "vpc-0f621b75ad71aa17d" -> null
        }
    }

  # module.functions.aws_lambda_function.get_investment_year_report_lambda_function will be destroyed
  # (because aws_lambda_function.get_investment_year_report_lambda_function is not in configuration)
  - resource "aws_lambda_function" "get_investment_year_report_lambda_function" {
      - arn                            = "arn:aws:lambda:us-west-2:435552912911:function:demo_get_investment_year_report_lambda_function" -> null
      - code_signing_config_arn        = "" -> null
      - description                    = "" -> null
      - function_name                  = "demo_get_investment_year_report_lambda_function" -> null
      - handler                        = "get_investment_year_report_handler.handler" -> null
      - id                             = "demo_get_investment_year_report_lambda_function" -> null
      - image_uri                      = "" -> null
      - invoke_arn                     = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:435552912911:function:demo_get_investment_year_report_lambda_function/invocations" -> null
      - kms_key_arn                    = "" -> null
      - last_modified                  = "2022-09-30T18:08:55.000+0000" -> null
      - layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22",
        ] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:us-west-2:435552912911:function:demo_get_investment_year_report_lambda_function:$LATEST" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::435552912911:role/demo_get_investment_year_report_lambda_exec_role" -> null
      - runtime                        = "python3.8" -> null
      - s3_bucket                      = "kpinetwork-backend" -> null
      - s3_key                         = "lambdas/demo/get_investment_year_report_handler.zip" -> null
      - signing_job_arn                = "" -> null
      - signing_profile_version_arn    = "" -> null
      - source_code_hash               = "a7XkxkNErA7yU7Ii8ZeDRep0roBcyFnjOeO3V01HR/k=" -> null
      - source_code_size               = 140457 -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
      - timeout                        = 100 -> null
      - version                        = "$LATEST" -> null

      - environment {
          - variables = {
              - "ACCESS_KEY"   = (sensitive)
              - "DB_HOST"      = (sensitive)
              - "DB_NAME"      = "demokpinetworkdb"
              - "DB_PASSWORD"  = (sensitive)
              - "DB_USERNAME"  = (sensitive)
              - "SECRET_KEY"   = (sensitive)
              - "USER_POOL_ID" = "us-west-2_usXw4S12D"
            } -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }

      - vpc_config {
          - security_group_ids = [
              - "sg-0bda66e4a9afc62a9",
            ] -> null
          - subnet_ids         = [
              - "subnet-0264422b45299167e",
            ] -> null
          - vpc_id             = "vpc-0f621b75ad71aa17d" -> null
        }
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2022-09-30T18:08:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "eUbzIiXDfIP5JcY4V628uhLOrowKwKvA9T3dpF+gpM4=" -> "/tvYfayvPspwdap72VpXKICUwYzmKfh7GUzWLy1tHso="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2022-09-30T18:09:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "PWmtTI1Qqq/0ZlcsWaILF4Hv3n2FeYkix6jr6/Iqmjc=" -> "dP1OSRAZldN86zCJd8ARrehZlbK5ZaIV/JYwkKLHBr4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2022-09-30T18:09:38.000+0000" -> (known after apply)
      ~ source_code_hash               = "ZY2DN082UEqRvsEjDfIdQoLiirvWhx8wPjMlFJwOWTg=" -> "KOFVdyvlPKGagN/FX5XbljyvdDUJaIq/QB7Onpt93uM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2022-09-30T18:08:59.000+0000" -> (known after apply)
      ~ source_code_hash               = "v+jBRSg4XnaLNAIFDHliNCTDtJ2/AwDg+qnzKYR4Crg=" -> "P/n/peHqapZNq52OQnOWAYks8AQw8akKX2k1TtwdiIY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2022-09-30T18:09:38.000+0000" -> (known after apply)
      ~ source_code_hash               = "IYUxm/27gAbrRsbHaI89Bn9r2zUdlnBXQR4oNiqa5IQ=" -> "BGAaJS4icYy9sFdDRGABejrI9aCSPbRIGzvvI1wqkbU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2022-09-30T18:08:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "KIH+2uT8NVcShJIBJI7WJY159jB2AdWl9pptyE+hSKE=" -> "6UsSf+Ck0dBvg5wclvbz7hGgCVV5MsRzGICwQxK63hc="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2022-09-30T18:08:56.000+0000" -> (known after apply)
      ~ source_code_hash               = "A1erIge4EyF2DfxGslEcZxh4in/wGLBaULhzdEg8U+k=" -> "5kOIF5+B9Dl/OYI+lGz2ZtOmTcojaACqxAf5X7mGLzM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2022-09-30T18:08:56.000+0000" -> (known after apply)
      ~ source_code_hash               = "eIJWnn/LPSbZZ5Y7jzyIb0GMjYwhCziFkOPD4nawguI=" -> "lOf3+CYOs3QoDFqfAnuRKnCUbA9C2l7NctSP7rInCWQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2022-09-30T18:08:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "m0fpac0hzJLcqMT4prIwQBfFMK0/z5EKfkLdZWG+xaU=" -> "rgPMoNBNOSdkyk7DI7jnG3XsDq0R1aO06R03zUgZPyo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2022-09-30T18:08:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "RUYl1EAUoFYKT44aI6ECdKpXDpd+0hzQlFx7HpLphfk=" -> "TCrH3twSpvZG6jIpcc01mXfuH5qYgwAcCmU8RqgfWE0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2022-09-30T18:08:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "zQo+vubyBGFAQff/7KOzQziH4ftWhtMxazEyp/GVlgE=" -> "OvPOgibA6ibZgtTwvgBHbobQF96eHIg5TMMKKUUZbM0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2022-09-30T18:08:37.000+0000" -> (known after apply)
      ~ source_code_hash               = "CFmpo/JVhipKEZ4vC3znB7UtzYk7mnfQpf1BE4mdHTI=" -> "CDYPkRXbFY9QTxU0B438P9mBBUkllDGv5L+loJtsmw4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2022-09-30T18:08:14Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "wdve7j" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2022-09-30T18:08:13Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.logs.aws_cloudwatch_log_group.get_all_tags_lambda_function will be created
  + resource "aws_cloudwatch_log_group" "get_all_tags_lambda_function" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/demo_get_all_tags_lambda_function"
      + retention_in_days = 14
      + tags_all          = (known after apply)
    }

  # module.logs.aws_cloudwatch_log_group.get_investment_year_options_lambda_function will be destroyed
  # (because aws_cloudwatch_log_group.get_investment_year_options_lambda_function is not in configuration)
  - resource "aws_cloudwatch_log_group" "get_investment_year_options_lambda_function" {
      - arn               = "arn:aws:logs:us-west-2:435552912911:log-group:/aws/lambda/demo_get_investment_year_options_lambda_function" -> null
      - id                = "/aws/lambda/demo_get_investment_year_options_lambda_function" -> null
      - name              = "/aws/lambda/demo_get_investment_year_options_lambda_function" -> null
      - retention_in_days = 14 -> null
      - tags              = {} -> null
      - tags_all          = {} -> null
    }

  # module.logs.aws_cloudwatch_log_group.get_investment_year_report_lambda_function will be destroyed
  # (because aws_cloudwatch_log_group.get_investment_year_report_lambda_function is not in configuration)
  - resource "aws_cloudwatch_log_group" "get_investment_year_report_lambda_function" {
      - arn               = "arn:aws:logs:us-west-2:435552912911:log-group:/aws/lambda/demo_get_investment_year_report_lambda_function" -> null
      - id                = "/aws/lambda/demo_get_investment_year_report_lambda_function" -> null
      - name              = "/aws/lambda/demo_get_investment_year_report_lambda_function" -> null
      - retention_in_days = 14 -> null
      - tags              = {} -> null
      - tags_all          = {} -> null
    }

  # module.network.aws_api_gateway_integration.get_all_tags_integration will be created
  + resource "aws_api_gateway_integration" "get_all_tags_integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = "kb7gblbu69"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.network.aws_api_gateway_integration.invest_year_options_integration will be destroyed
  # (because aws_api_gateway_integration.invest_year_options_integration is not in configuration)
  - resource "aws_api_gateway_integration" "invest_year_options_integration" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "gq814s" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "GET" -> null
      - id                      = "agi-kb7gblbu69-gq814s-GET" -> null
      - integration_http_method = "POST" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      - resource_id             = "gq814s" -> null
      - rest_api_id             = "kb7gblbu69" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "AWS_PROXY" -> null
      - uri                     = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:435552912911:function:demo_get_investment_year_options_lambda_function/invocations" -> null
    }

  # module.network.aws_api_gateway_integration.investment_report_integration will be destroyed
  # (because aws_api_gateway_integration.investment_report_integration is not in configuration)
  - resource "aws_api_gateway_integration" "investment_report_integration" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "ieupa8" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "GET" -> null
      - id                      = "agi-kb7gblbu69-ieupa8-GET" -> null
      - integration_http_method = "POST" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      - resource_id             = "ieupa8" -> null
      - rest_api_id             = "kb7gblbu69" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "AWS_PROXY" -> null
      - uri                     = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:435552912911:function:demo_get_investment_year_report_lambda_function/invocations" -> null
    }

  # module.network.aws_api_gateway_method.dynamic_report_method will be updated in-place
  ~ resource "aws_api_gateway_method" "dynamic_report_method" {
        id                   = "agm-kb7gblbu69-1c508f-GET"
      ~ request_parameters   = {
          - "method.request.querystring.investment_year"  = false -> null
            # (8 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.network.aws_api_gateway_method.get_all_tags_method will be created
  + resource "aws_api_gateway_method" "get_all_tags_method" {
      + api_key_required   = false
      + authorization      = "CUSTOM"
      + authorizer_id      = "3y14fs"
      + http_method        = "GET"
      + id                 = (known after apply)
      + request_parameters = {
          + "method.request.querystring.limit"  = false
          + "method.request.querystring.offset" = false
        }
      + resource_id        = (known after apply)
      + rest_api_id        = "kb7gblbu69"
    }

  # module.network.aws_api_gateway_method.get_investment_year_options_method will be destroyed
  # (because aws_api_gateway_method.get_investment_year_options_method is not in configuration)
  - resource "aws_api_gateway_method" "get_investment_year_options_method" {
      - api_key_required     = false -> null
      - authorization        = "CUSTOM" -> null
      - authorization_scopes = [] -> null
      - authorizer_id        = "3y14fs" -> null
      - http_method          = "GET" -> null
      - id                   = "agm-kb7gblbu69-gq814s-GET" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "gq814s" -> null
      - rest_api_id          = "kb7gblbu69" -> null
    }

  # module.network.aws_api_gateway_method.get_investment_year_report_method will be destroyed
  # (because aws_api_gateway_method.get_investment_year_report_method is not in configuration)
  - resource "aws_api_gateway_method" "get_investment_year_report_method" {
      - api_key_required     = false -> null
      - authorization        = "CUSTOM" -> null
      - authorization_scopes = [] -> null
      - authorizer_id        = "3y14fs" -> null
      - http_method          = "GET" -> null
      - id                   = "agm-kb7gblbu69-ieupa8-GET" -> null
      - request_models       = {} -> null
      - request_parameters   = {
          - "method.request.querystring.from_main"        = false
          - "method.request.querystring.growth_profile"   = false
          - "method.request.querystring.invest_year"      = false
          - "method.request.querystring.investor_profile" = false
          - "method.request.querystring.sector"           = false
          - "method.request.querystring.size"             = false
          - "method.request.querystring.vertical"         = false
        } -> null
      - resource_id          = "ieupa8" -> null
      - rest_api_id          = "kb7gblbu69" -> null
    }

  # module.network.aws_api_gateway_resource.tags will be created
  + resource "aws_api_gateway_resource" "tags" {
      + id          = (known after apply)
      + parent_id   = "0ay34r2gi9"
      + path        = (known after apply)
      + path_part   = "tags"
      + rest_api_id = "kb7gblbu69"
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2022-09-30T18:09:45Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
        
```

</details>

*Pusher: @FreddyJR1995, Action: `pull_request`*